"""
Задача 1
Напишите программу, которая заменяет и удаляет всё лишнее из строки:

“У в%%А№с вввв@c~ё ппп$$ПО&л%у**Ч**<>и!тс::я”

Вывод представьте прописными буквами.
"""

my_str = ("“У в%%А№с вввв@c~ё ппп$$ПО&л%у**Ч**<>и!тс::я”".replace('%',  '').replace('№', '').
          replace('@', '').replace('~', '').replace('$', '').
          replace('&','').replace('*','').replace('<', '').
          replace('>','').replace('!','').replace(':','').
          replace('ввв', '').replace('ппп', ''))
print(my_str.lower())

